Revit 2027 API
IFCCategoryTemplate.GetMappingInfoById Method
 Gets a copy of IFC mapping info by category id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportIFCCategoryInfo GetMappingInfoById(
	Document document,
	ElementId categoryId,
	CustomSubCategoryId customSubCategoryId
)
Public Function GetMappingInfoById (
	document As Document,
	categoryId As ElementId,
	customSubCategoryId As CustomSubCategoryId
) As ExportIFCCategoryInfo
public:
ExportIFCCategoryInfo^ GetMappingInfoById(
	Document^ document,
	ElementId^ categoryId,
	CustomSubCategoryId customSubCategoryId
)
member GetMappingInfoById :
        document : Document *
        categoryId : ElementId *
        customSubCategoryId : CustomSubCategoryId -> ExportIFCCategoryInfo
Parameters
document Document
 A Revit document.
categoryId ElementId
 The category id.
customSubCategoryId CustomSubCategoryId
 The custom subcategory id.
Return Value
ExportIFCCategoryInfo
 Return the info for this category.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace